org/posts/elisp.org
#+TITLE: Emacs Lisp
#+DATE: 2026-06-24
#+TAGS: Emacs
#+DESCRIPTION: A comprehensive Emacs Lisp guide covering Elisp fundamentals, Emacs internals, package development, macros, debugging, performance optimization, asynchronous programming, and advanced editor extension development.
#+OPTIONS: toc:nil num:nil html-postamble:nil
#+HTML_HEAD: <link rel="stylesheet" href="/static/css/style.css" type="text/css"/>

#+INCLUDE: "../header.org"

* Emacs Lisp Q&A (Beginner to Advanced)

A comprehensive question-and-answer guide for Emacs Lisp.

Designed for:

- Learning Emacs Lisp from scratch
- Understanding Emacs internals
- Building packages and extensions
- Becoming an advanced Emacs developer

Study progressively from fundamentals to advanced package development.

[[https://www.gnu.org/software/emacs/manual/][Emacs Manual]]

-----

* Beginner — Fundamentals

** Q1: What is Emacs Lisp?
A dialect of Lisp that serves as the extension language of Emacs.
The Emacs editor is largely written in it, and you use it to configure and extend Emacs.
It is a dynamically-typed, primarily dynamically-scoped (historically) Lisp
with deep integration into the editor (buffers, windows, text properties).

** Q2: How do I evaluate an Elisp expression interactively?
 - =C-x C-e= evaluates the expression *before point* (=eval-last-sexp=).
 - =M-x eval-expression= (=M-:=) prompts for an expression in the minibuffer.
 - =M-x eval-buffer= / =eval-region= evaluate larger chunks.
 - =ielm= opens an interactive Elisp REPL.

** Q3: What is the difference between a "form" and an "expression"?
They are used almost interchangeably. A *form* is any Lisp object meant to be evaluated.
Self-evaluating forms (numbers, strings, keywords), symbol forms
(variables), and list forms (function/macro/special-form calls) are the categories.

** Q4: How do you write a comment in Elisp?
With a semicolon =;=. Conventions:
 - =;= inline comment after code.
 - =;;= comment aligned to the code's indentation.
 - =;;;= top-level/section comment.
 - =;;;;= heading.

** Q5: What are the basic data types?
Integers, floats, symbols, strings, characters (which are integers), cons cells/lists,
vectors, hash tables, and more specialized types like markers, buffers, and overlays.

** Q6: How do I define a variable?
#+begin_src elisp
(defvar my-var 10 "A docstring.")   ; only sets if currently unbound
(defconst my-pi 3.14159 "Pi.")      ; intended as a constant
(setq my-var 20)                    ; assignment
#+end_src

** Q7: What is the difference between =defvar= and =setq=?
=defvar= *declares* a special (dynamic) variable and assigns a default only if
it is not already bound. =setq= simply assigns a value to an existing binding.
Use =defvar= for global configuration variables so re-evaluating a file doesn't clobber a user's value.

** Q8: How do I define a function?
#+begin_src elisp
(defun my-add (a b)
  "Return the sum of A and B."
  (+ a b))
#+end_src

** Q9: What makes a function a "command"?
Adding =(interactive ...)= as its first form.
Commands can be invoked via =M-x= and bound to keys.

#+begin_src elisp
(defun my-greet ()
  (interactive)
  (message "Hello!"))
#+end_src

** Q10: What does =message= do?
Displays a formatted string in the echo area and logs it to the =*Messages*= buffer.
Uses =format=-style directives: =%s=, =%d=, =%S=, etc.

** Q11: What is =nil= and =t=?
=nil= is the canonical false value and also the empty list =()=.
=t= is the canonical true value.
Everything other than =nil= is truthy.

** Q12: Is the empty list the same as nil?
Yes. =()= and =nil= are identical objects in Elisp.

** Q13: How do I create a list?
#+begin_src elisp
(list 1 2 3)        ; => (1 2 3)
'(1 2 3)            ; quoted literal
(cons 1 '(2 3))     ; => (1 2 3)
#+end_src

** Q14: What is the difference between =quote= and =list=?
=(list 1 (+ 1 1))= evaluates its arguments → =(1 2)=.
='(1 (+ 1 1))= does not evaluate → =(1 (+ 1 1))=. ='x= is shorthand for =(quote x)=.

** Q15: What are =car= and =cdr=?
=car= returns the first element of a cons cell; =cdr= returns the rest.
For a list =(1 2 3)=: =(car list)= → 1, =(cdr list)= → =(2 3)=.

** Q16: How do I get the Nth element of a list?
#+begin_src elisp
(nth 2 '(a b c d))    ; => c  (zero-based)
(nthcdr 2 '(a b c d)) ; => (c d)
(elt '(a b c) 1)      ; => b  (works on sequences)
#+end_src

** Q17: How do I add an element to the front of a list?
#+begin_src elisp
(cons 0 '(1 2 3))     ; => (0 1 2 3)
(push 0 my-list)      ; destructively updates the variable
#+end_src

