public/posts/elisp.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Lisp</title>
<meta name="description" content="A comprehensive Emacs Lisp guide covering Elisp fundamentals, Emacs internals, package development, macros, debugging, performance optimization, asynchronous programming, and advanced editor extension development." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/css/style.css" type="text/css"/>
<link rel="stylesheet" href="/static/css/style.css" type="text/css"/>
<link rel="stylesheet" href="/static/css/style.css" type="text/css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Emacs Lisp</h1>
</header><div class="site-header">
  <div class="site-title"><a href="/">Borislav Dostumski</a></div>
  <nav class="site-nav">
    <a href="/index.html">Index</a>
    <a href="/certificates.html">Certificates</a>
    <a href="/blog.html">Blog</a>
    <a href="/about.html">Bio</a>
  </nav>
</div>
<div id="outline-container-orgd9b8d45" class="outline-2">
<h2 id="orgd9b8d45">Emacs Lisp Q&amp;A (Beginner to Advanced)</h2>
<div class="outline-text-2" id="text-orgd9b8d45">
<p>
A comprehensive question-and-answer guide for Emacs Lisp.
</p>

<p>
Designed for:
</p>

<ul class="org-ul">
<li>Learning Emacs Lisp from scratch</li>
<li>Understanding Emacs internals</li>
<li>Building packages and extensions</li>
<li>Becoming an advanced Emacs developer</li>
</ul>

<p>
Study progressively from fundamentals to advanced package development.
</p>

<p>
<a href="https://www.gnu.org/software/emacs/manual/">Emacs Manual</a>
</p>

<hr>
</div>
</div>
<div id="outline-container-orgd352b6b" class="outline-2">
<h2 id="orgd352b6b">Beginner — Fundamentals</h2>
<div class="outline-text-2" id="text-orgd352b6b">
</div>
<div id="outline-container-org5032f5d" class="outline-3">
<h3 id="org5032f5d">Q1: What is Emacs Lisp?</h3>
<div class="outline-text-3" id="text-org5032f5d">
<p>
A dialect of Lisp that serves as the extension language of Emacs.
The Emacs editor is largely written in it, and you use it to configure and extend Emacs.
It is a dynamically-typed, primarily dynamically-scoped (historically) Lisp
with deep integration into the editor (buffers, windows, text properties).
</p>
</div>
</div>
<div id="outline-container-org3d4eb9c" class="outline-3">
<h3 id="org3d4eb9c">Q2: How do I evaluate an Elisp expression interactively?</h3>
<div class="outline-text-3" id="text-org3d4eb9c">
<ul class="org-ul">
<li><code>C-x C-e</code> evaluates the expression <b>before point</b> (<code>eval-last-sexp</code>).</li>
<li><code>M-x eval-expression</code> (<code>M-:</code>) prompts for an expression in the minibuffer.</li>
<li><code>M-x eval-buffer</code> / <code>eval-region</code> evaluate larger chunks.</li>
<li><code>ielm</code> opens an interactive Elisp REPL.</li>
</ul>
</div>
</div>
<div id="outline-container-orgeab953e" class="outline-3">
<h3 id="orgeab953e">Q3: What is the difference between a "form" and an "expression"?</h3>
<div class="outline-text-3" id="text-orgeab953e">
<p>
They are used almost interchangeably. A <b>form</b> is any Lisp object meant to be evaluated.
Self-evaluating forms (numbers, strings, keywords), symbol forms
(variables), and list forms (function/macro/special-form calls) are the categories.
</p>
</div>
</div>
<div id="outline-container-org28998ca" class="outline-3">
<h3 id="org28998ca">Q4: How do you write a comment in Elisp?</h3>
<div class="outline-text-3" id="text-org28998ca">
<p>
With a semicolon <code>;</code>. Conventions:
</p>
<ul class="org-ul">
<li><code>;</code> inline comment after code.</li>
<li><code>;;</code> comment aligned to the code's indentation.</li>
<li><code>;;;</code> top-level/section comment.</li>
<li><code>;;;;</code> heading.</li>
</ul>
</div>
</div>
<div id="outline-container-org737dc06" class="outline-3">
<h3 id="org737dc06">Q5: What are the basic data types?</h3>
<div class="outline-text-3" id="text-org737dc06">
<p>
Integers, floats, symbols, strings, characters (which are integers), cons cells/lists,
vectors, hash tables, and more specialized types like markers, buffers, and overlays.
</p>
</div>
</div>
<div id="outline-container-org8dabaed" class="outline-3">
<h3 id="org8dabaed">Q6: How do I define a variable?</h3>
<div class="outline-text-3" id="text-org8dabaed">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">defvar</span> <span style="font-weight: bold; font-style: italic;">my-var</span> 10 <span style="font-style: italic;">"A docstring."</span>)   <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">only sets if currently unbound
</span>(<span style="font-weight: bold;">defconst</span> <span style="font-weight: bold; font-style: italic;">my-pi</span> 3.14159 <span style="font-style: italic;">"Pi."</span>)      <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">intended as a constant
</span>(<span style="font-weight: bold;">setq</span> my-var 20)                    <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">assignment</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6ecb2fc" class="outline-3">
<h3 id="org6ecb2fc">Q7: What is the difference between <code>defvar</code> and <code>setq</code>?</h3>
<div class="outline-text-3" id="text-org6ecb2fc">
<p>
<code>defvar</code> <b>declares</b> a special (dynamic) variable and assigns a default only if
it is not already bound. <code>setq</code> simply assigns a value to an existing binding.
Use <code>defvar</code> for global configuration variables so re-evaluating a file doesn't clobber a user's value.
</p>
</div>
</div>
<div id="outline-container-org1555378" class="outline-3">
<h3 id="org1555378">Q8: How do I define a function?</h3>
<div class="outline-text-3" id="text-org1555378">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my-add</span> (a b)
  <span style="font-style: italic;">"Return the sum of A and B."</span>
  (+ a b))
</pre>
</div>
</div>
</div>
<div id="outline-container-org3a365e4" class="outline-3">
<h3 id="org3a365e4">Q9: What makes a function a "command"?</h3>
<div class="outline-text-3" id="text-org3a365e4">
<p>
Adding <code>(interactive ...)</code> as its first form.
Commands can be invoked via <code>M-x</code> and bound to keys.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my-greet</span> ()
  (<span style="font-weight: bold;">interactive</span>)
  (message <span style="font-style: italic;">"Hello!"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgae2a70d" class="outline-3">
<h3 id="orgae2a70d">Q10: What does <code>message</code> do?</h3>
<div class="outline-text-3" id="text-orgae2a70d">
<p>
Displays a formatted string in the echo area and logs it to the <code>*Messages*</code> buffer.
Uses <code>format</code>-style directives: <code>%s</code>, <code>%d</code>, <code>%S</code>, etc.
</p>
</div>
</div>
<div id="outline-container-org6c0ac9f" class="outline-3">
<h3 id="org6c0ac9f">Q11: What is <code>nil</code> and <code>t</code>?</h3>
<div class="outline-text-3" id="text-org6c0ac9f">
<p>
<code>nil</code> is the canonical false value and also the empty list <code>()</code>.
<code>t</code> is the canonical true value.
Everything other than <code>nil</code> is truthy.
</p>
</div>
</div>
<div id="outline-container-orgded5db7" class="outline-3">
<h3 id="orgded5db7">Q12: Is the empty list the same as nil?</h3>
<div class="outline-text-3" id="text-orgded5db7">
<p>
Yes. <code>()</code> and <code>nil</code> are identical objects in Elisp.
</p>
</div>
</div>
<div id="outline-container-org4120df9" class="outline-3">
<h3 id="org4120df9">Q13: How do I create a list?</h3>
<div class="outline-text-3" id="text-org4120df9">
<div class="org-src-container">
<pre class="src src-elisp">(list 1 2 3)        <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; (1 2 3)
</span>'(1 2 3)            <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">quoted literal
</span>(cons 1 '(2 3))     <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; (1 2 3)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcf02671" class="outline-3">
<h3 id="orgcf02671">Q14: What is the difference between <code>quote</code> and <code>list</code>?</h3>
<div class="outline-text-3" id="text-orgcf02671">
<p>
<code>(list 1 (+ 1 1))</code> evaluates its arguments → <code>(1 2)</code>.
<code>'(1 (+ 1 1))</code> does not evaluate → <code>(1 (+ 1 1))</code>. <code>'x</code> is shorthand for <code>(quote x)</code>.
</p>
</div>
</div>
<div id="outline-container-org9165681" class="outline-3">
<h3 id="org9165681">Q15: What are <code>car</code> and <code>cdr</code>?</h3>
<div class="outline-text-3" id="text-org9165681">
<p>
<code>car</code> returns the first element of a cons cell; <code>cdr</code> returns the rest.
For a list <code>(1 2 3)</code>: <code>(car list)</code> → 1, <code>(cdr list)</code> → <code>(2 3)</code>.
</p>
</div>
</div>
<div id="outline-container-org5cc2eef" class="outline-3">
<h3 id="org5cc2eef">Q16: How do I get the Nth element of a list?</h3>
<div class="outline-text-3" id="text-org5cc2eef">
<div class="org-src-container">
<pre class="src src-elisp">(nth 2 '(a b c d))    <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; c  (zero-based)
</span>(nthcdr 2 '(a b c d)) <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; (c d)
</span>(elt '(a b c) 1)      <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; b  (works on sequences)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3e271b2" class="outline-3">
<h3 id="org3e271b2">Q17: How do I add an element to the front of a list?</h3>
<div class="outline-text-3" id="text-org3e271b2">
<div class="org-src-container">
<pre class="src src-elisp">(cons 0 '(1 2 3))     <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; (0 1 2 3)
</span>(<span style="font-weight: bold;">push</span> 0 my-list)      <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">destructively updates the variable</span>
</pre>
</div>
</div>
</div>
