org/posts/elisp.org
** Q18: How do I check equality?
 - =eq= — identity (same object); good for symbols, small integers.
 - =eql= — like =eq= but also compares numbers of the same type.
 - =equal= — structural equality (lists, strings).
 - ===  — numeric equality (numbers only).
 - =string== — string equality.

** Q19: How do I write an if statement?
#+begin_src elisp
(if (> x 0)
    (message "positive")     ; then (single form)
  (message "non-positive"))  ; else (any number of forms)
#+end_src

** Q20: What is =when= and =unless=?
=when= runs its body if the condition is non-nil (no else).
=unless= runs its body if the condition is nil. Both allow multiple body forms without =progn=.

** Q21: What is =progn=?
Evaluates several forms in sequence and returns the value of the last.
Useful where a single form is expected but you need several.

** Q22: How does =cond= work?
A multi-branch conditional:

#+begin_src elisp
(cond
((< x 0) "negative")
((= x 0) "zero")
(t       "positive"))
#+end_src

** Q23: What is =let= vs =let*=?
=let= binds all variables in parallel (initializers can't see each other).
=let*= binds sequentially so later bindings can reference earlier ones.

#+begin_src elisp
(let* ((a 1) (b (+ a 1))) b)  ; => 2  (let would error: a unbound)
#+end_src

** Q24: How do I loop over a list?
#+begin_src elisp
(dolist (item '(1 2 3))
  (message "%d" item))
#+end_src

** Q25: How do I loop N times?
#+begin_src elisp
(dotimes (i 5)
  (message "%d" i))   ; i goes 0..4
#+end_src

** Q26: How do I write a while loop?
#+begin_src elisp
(let ((i 0))
  (while (< i 5)
    (message "%d" i)
    (setq i (1+ i))))
#+end_src

** Q27: How do I format a string?
#+begin_src elisp
(format "Name: %s, Age: %d" "Bob" 42)
#+end_src

=format-message= additionally translates quote characters for messages.

** Q28: What is the difference between =%s= and =%S= in format?
=%s= uses =princ=-style (human-readable, no quotes on strings).
=%S= uses =prin1=-style (a readable, re-parseable representation with quotes/escapes).

** Q29: How do I concatenate strings?
#+begin_src elisp
(concat "foo" "-" "bar")   ; => "foo-bar"
#+end_src

** Q30: How do I read documentation for a function or variable?
- =C-h f= (=describe-function=)
- =C-h v= (=describe-variable=)
- =C-h k= (=describe-key=)
- =C-h o= (=describe-symbol=) — function or variable.

** Q31: What is a symbol?
A first-class named object with four cells: name, value (variable binding), function (function binding), and property list.
Symbols are interned in =obarray= so identical names refer to the same object.

** Q32: What is the difference between a symbol's value cell and function cell?
A symbol can simultaneously name a variable and a function.
=(foo)= uses the function cell; =foo= as a value uses the value cell. This is why Elisp is a "Lisp-2".

** Q33: How do I get/set a symbol's value programmatically?
#+begin_src elisp
(symbol-value 'my-var)
(set 'my-var 5)            ; like setq but evaluates the symbol arg
(symbol-function 'my-fn)
(fset 'my-fn (lambda () 1))
#+end_src

** Q34: What is a keyword symbol?
A symbol starting with =:= (e.g. =:foo=). It is self-evaluating and used as a constant marker, frequently in plists and keyword arguments.

** Q35: How do I convert between strings, symbols, and numbers?
#+begin_src elisp
(intern "foo")          ; string -> symbol
(symbol-name 'foo)      ; symbol -> string
(number-to-string 42)   ; -> "42"
(string-to-number "42") ; -> 42
#+end_src

* Beginner/Intermediate — Working with Emacs
** Q36: What is the "current buffer"?
The buffer that Elisp functions operate on by default. Most editing functions implicitly act on it. =current-buffer= returns it.

** Q37: What is "point"?
The location of the cursor / insertion position in a buffer, between two characters.
=(point)= returns its integer position; =point-min= and =point-max= give the buffer boundaries.

** Q38: How do I move point?
#+begin_src elisp
(goto-char (point-min))
(forward-char 5)
(forward-line 2)
(beginning-of-line)
#+end_src

** Q39: How do I insert text at point?
#+begin_src elisp
(insert "Hello, world")
(insert-char ?* 3)   ; inserts ***
#+end_src

