public/posts/elisp.html
<div id="outline-container-org642350b" class="outline-3">
<h3 id="org642350b">Q18: How do I check equality?</h3>
<div class="outline-text-3" id="text-org642350b">
<ul class="org-ul">
<li><code>eq</code> — identity (same object); good for symbols, small integers.</li>
<li><code>eql</code> — like <code>eq</code> but also compares numbers of the same type.</li>
<li><code>equal</code> — structural equality (lists, strings).</li>
<li><code>=</code>  — numeric equality (numbers only).</li>
<li><code>string=</code> — string equality.</li>
</ul>
</div>
</div>
<div id="outline-container-org8d36256" class="outline-3">
<h3 id="org8d36256">Q19: How do I write an if statement?</h3>
<div class="outline-text-3" id="text-org8d36256">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">if</span> (&gt; x 0)
    (message <span style="font-style: italic;">"positive"</span>)     <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">then (single form)
</span>  (message <span style="font-style: italic;">"non-positive"</span>))  <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">else (any number of forms)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfe94d04" class="outline-3">
<h3 id="orgfe94d04">Q20: What is <code>when</code> and <code>unless</code>?</h3>
<div class="outline-text-3" id="text-orgfe94d04">
<p>
<code>when</code> runs its body if the condition is non-nil (no else).
<code>unless</code> runs its body if the condition is nil. Both allow multiple body forms without <code>progn</code>.
</p>
</div>
</div>
<div id="outline-container-orgfa3e78b" class="outline-3">
<h3 id="orgfa3e78b">Q21: What is <code>progn</code>?</h3>
<div class="outline-text-3" id="text-orgfa3e78b">
<p>
Evaluates several forms in sequence and returns the value of the last.
Useful where a single form is expected but you need several.
</p>
</div>
</div>
<div id="outline-container-org99abd7b" class="outline-3">
<h3 id="org99abd7b">Q22: How does <code>cond</code> work?</h3>
<div class="outline-text-3" id="text-org99abd7b">
<p>
A multi-branch conditional:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">cond</span>
((&lt; x 0) <span style="font-style: italic;">"negative"</span>)
((= x 0) <span style="font-style: italic;">"zero"</span>)
(t       <span style="font-style: italic;">"positive"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-org6508ec0" class="outline-3">
<h3 id="org6508ec0">Q23: What is <code>let</code> vs <code>let*</code>?</h3>
<div class="outline-text-3" id="text-org6508ec0">
<p>
<code>let</code> binds all variables in parallel (initializers can't see each other).
<code>let*</code> binds sequentially so later bindings can reference earlier ones.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">let*</span> ((a 1) (b (+ a 1))) b)  <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; 2  (let would error: a unbound)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7a98993" class="outline-3">
<h3 id="org7a98993">Q24: How do I loop over a list?</h3>
<div class="outline-text-3" id="text-org7a98993">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">dolist</span> (item '(1 2 3))
  (message <span style="font-style: italic;">"%d"</span> item))
</pre>
</div>
</div>
</div>
<div id="outline-container-orga35f91f" class="outline-3">
<h3 id="orga35f91f">Q25: How do I loop N times?</h3>
<div class="outline-text-3" id="text-orga35f91f">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">dotimes</span> (i 5)
  (message <span style="font-style: italic;">"%d"</span> i))   <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">i goes 0..4</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org79d5308" class="outline-3">
<h3 id="org79d5308">Q26: How do I write a while loop?</h3>
<div class="outline-text-3" id="text-org79d5308">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">let</span> ((i 0))
  (<span style="font-weight: bold;">while</span> (&lt; i 5)
    (message <span style="font-style: italic;">"%d"</span> i)
    (<span style="font-weight: bold;">setq</span> i (1+ i))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org229515c" class="outline-3">
<h3 id="org229515c">Q27: How do I format a string?</h3>
<div class="outline-text-3" id="text-org229515c">
<div class="org-src-container">
<pre class="src src-elisp">(format <span style="font-style: italic;">"Name: %s, Age: %d"</span> <span style="font-style: italic;">"Bob"</span> 42)
</pre>
</div>

<p>
<code>format-message</code> additionally translates quote characters for messages.
</p>
</div>
</div>
<div id="outline-container-orgeed88d4" class="outline-3">
<h3 id="orgeed88d4">Q28: What is the difference between <code>%s</code> and <code>%S</code> in format?</h3>
<div class="outline-text-3" id="text-orgeed88d4">
<p>
<code>%s</code> uses <code>princ</code>-style (human-readable, no quotes on strings).
<code>%S</code> uses <code>prin1</code>-style (a readable, re-parseable representation with quotes/escapes).
</p>
</div>
</div>
<div id="outline-container-org273cfef" class="outline-3">
<h3 id="org273cfef">Q29: How do I concatenate strings?</h3>
<div class="outline-text-3" id="text-org273cfef">
<div class="org-src-container">
<pre class="src src-elisp">(concat <span style="font-style: italic;">"foo"</span> <span style="font-style: italic;">"-"</span> <span style="font-style: italic;">"bar"</span>)   <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; "foo-bar"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5fd9ecb" class="outline-3">
<h3 id="org5fd9ecb">Q30: How do I read documentation for a function or variable?</h3>
<div class="outline-text-3" id="text-org5fd9ecb">
<ul class="org-ul">
<li><code>C-h f</code> (<code>describe-function</code>)</li>
<li><code>C-h v</code> (<code>describe-variable</code>)</li>
<li><code>C-h k</code> (<code>describe-key</code>)</li>
<li><code>C-h o</code> (<code>describe-symbol</code>) — function or variable.</li>
</ul>
</div>
</div>
<div id="outline-container-org60b9c0c" class="outline-3">
<h3 id="org60b9c0c">Q31: What is a symbol?</h3>
<div class="outline-text-3" id="text-org60b9c0c">
<p>
A first-class named object with four cells: name, value (variable binding), function (function binding), and property list.
Symbols are interned in <code>obarray</code> so identical names refer to the same object.
</p>
</div>
</div>
<div id="outline-container-orgf96ca52" class="outline-3">
<h3 id="orgf96ca52">Q32: What is the difference between a symbol's value cell and function cell?</h3>
<div class="outline-text-3" id="text-orgf96ca52">
<p>
A symbol can simultaneously name a variable and a function.
<code>(foo)</code> uses the function cell; <code>foo</code> as a value uses the value cell. This is why Elisp is a "Lisp-2".
</p>
</div>
</div>
<div id="outline-container-org69cfa3d" class="outline-3">
<h3 id="org69cfa3d">Q33: How do I get/set a symbol's value programmatically?</h3>
<div class="outline-text-3" id="text-org69cfa3d">
<div class="org-src-container">
<pre class="src src-elisp">(symbol-value 'my-var)
(set 'my-var 5)            <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">like setq but evaluates the symbol arg
</span>(symbol-function 'my-fn)
(fset 'my-fn (<span style="font-weight: bold;">lambda</span> () 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-org24dfe07" class="outline-3">
<h3 id="org24dfe07">Q34: What is a keyword symbol?</h3>
<div class="outline-text-3" id="text-org24dfe07">
<p>
A symbol starting with <code>:</code> (e.g. <code>:foo</code>). It is self-evaluating and used as a constant marker, frequently in plists and keyword arguments.
</p>
</div>
</div>
<div id="outline-container-orgbdb9f2d" class="outline-3">
<h3 id="orgbdb9f2d">Q35: How do I convert between strings, symbols, and numbers?</h3>
<div class="outline-text-3" id="text-orgbdb9f2d">
<div class="org-src-container">
<pre class="src src-elisp">(intern <span style="font-style: italic;">"foo"</span>)          <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">string -&gt; symbol
</span>(symbol-name 'foo)      <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">symbol -&gt; string
</span>(number-to-string 42)   <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">-&gt; "42"
</span>(string-to-number <span style="font-style: italic;">"42"</span>) <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">-&gt; 42</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdf48705" class="outline-2">
<h2 id="orgdf48705">Beginner/Intermediate — Working with Emacs</h2>
<div class="outline-text-2" id="text-orgdf48705">
</div>
<div id="outline-container-orga79af49" class="outline-3">
<h3 id="orga79af49">Q36: What is the "current buffer"?</h3>
<div class="outline-text-3" id="text-orga79af49">
<p>
The buffer that Elisp functions operate on by default. Most editing functions implicitly act on it. <code>current-buffer</code> returns it.
</p>
</div>
</div>
<div id="outline-container-orgda76e81" class="outline-3">
<h3 id="orgda76e81">Q37: What is "point"?</h3>
<div class="outline-text-3" id="text-orgda76e81">
<p>
The location of the cursor / insertion position in a buffer, between two characters.
<code>(point)</code> returns its integer position; <code>point-min</code> and <code>point-max</code> give the buffer boundaries.
</p>
</div>
</div>
<div id="outline-container-org5c3c7cb" class="outline-3">
<h3 id="org5c3c7cb">Q38: How do I move point?</h3>
<div class="outline-text-3" id="text-org5c3c7cb">
<div class="org-src-container">
<pre class="src src-elisp">(goto-char (point-min))
(forward-char 5)
(forward-line 2)
(beginning-of-line)
</pre>
</div>
</div>
</div>
<div id="outline-container-org7c5e47b" class="outline-3">
<h3 id="org7c5e47b">Q39: How do I insert text at point?</h3>
<div class="outline-text-3" id="text-org7c5e47b">
<div class="org-src-container">
<pre class="src src-elisp">(insert <span style="font-style: italic;">"Hello, world"</span>)
(insert-char ?* 3)   <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">inserts ***</span>
</pre>
</div>
</div>
</div>
