org/posts/elisp.org
** Q40: How do I read text from the buffer?
#+begin_src elisp
(buffer-string)                       ; whole buffer
(buffer-substring start end)          ; with properties
(buffer-substring-no-properties s e)  ; plain text
(thing-at-point 'word)
#+end_src

** Q41: What is =save-excursion=?
A macro that saves point (and the current buffer) and restores them after its
body runs — even on non-local exit. Use it when you move point temporarily.

#+begin_src elisp
(save-excursion
  (goto-char (point-min))
  (insert "header\n"))
#+end_src

** Q42: What is =save-restriction=?
Saves and restores the buffer's narrowing state (the visible region set by =narrow-to-region= / =widen=).

** Q43: How do I switch the buffer Elisp operates on?
#+begin_src elisp
(with-current-buffer "*scratch*"
  (insert "hi"))
(set-buffer buf)   ; lower-level, no automatic restore
#+end_src

** Q44: How do I create a new buffer?
#+begin_src elisp
(get-buffer-create "*my-buffer*")
(generate-new-buffer "*my-buffer*")  ; guarantees a fresh, uniquely-named one
#+end_src

** Q45: What is the difference between =switch-to-buffer= and =set-buffer=?
=switch-to-buffer= makes a buffer visible in the selected window (interactive,
display-oriented). =set-buffer= only changes the current buffer for Elisp; it
does not change what is displayed and is not preserved after the command.

** Q46: How do I read a file into a string?
#+begin_src elisp
(with-temp-buffer
  (insert-file-contents "/path/to/file")
  (buffer-string))
#+end_src

** Q47: How do I write a string to a file?
#+begin_src elisp
(with-temp-file "/path/to/file"
  (insert "content"))
#+end_src

** Q48: What is =with-temp-buffer=?
Creates a temporary buffer, makes it current for the body, and kills it afterward.
Ideal for text processing that shouldn't touch user buffers.

** Q49: How do I bind a key globally?
#+begin_src elisp
(global-set-key (kbd "C-c g") #'my-greet)
(keymap-global-set "C-c g" #'my-greet)  ; modern API (Emacs 29+)
#+end_src

** Q50: How do I bind a key in a specific mode?
#+begin_src elisp
(define-key emacs-lisp-mode-map (kbd "C-c r") #'my-run)
(keymap-set emacs-lisp-mode-map "C-c r" #'my-run)  ; Emacs 29+
#+end_src

** Q51: What is =kbd= and why use it?
=kbd= converts a human-readable key description (="C-c C-x"=) into the internal
key sequence representation. It's portable and clearer than raw string/vector forms.

** Q52: How do I prompt the user for input?
#+begin_src elisp
(read-string "Name: ")
(read-number "Count: ")
(completing-read "Choose: " '("a" "b" "c"))
(yes-or-no-p "Continue? ")
(y-or-n-p "Continue? ")
#+end_src

** Q53: What is the =interactive= spec code "p" vs "P"?
=p= passes the numeric prefix argument as a number. =P= passes the *raw* prefix
argument (e.g. =nil=, =(4)=, a number). Many codes exist: =s= string, =n=
number, =r= region, =b= buffer name, etc.

** Q54: How do I get the region's text?
#+begin_src elisp
(buffer-substring-no-properties (region-beginning) (region-end))
#+end_src

For commands, declare =(interactive "r")= to receive start and end.

** Q55: How do I run code only after Emacs starts up?
Use =after-init-hook= or =emacs-startup-hook=:

#+begin_src elisp
(add-hook 'emacs-startup-hook #'my-startup-fn)
#+end_src

* Intermediate — Functions, Scope, Data

** Q56: What is a lambda?
An anonymous function:

#+begin_src elisp
(lambda (x) (* x x))
(funcall (lambda (x) (* x x)) 5)  ; => 25
#+end_src

** Q57: What is the =#'= reader macro?
=#'foo= is shorthand for =(function foo)=. It quotes a function, and for
lambdas it signals to the byte-compiler that the form is a function (enabling compilation of the lambda).

** Q58: What is the difference between =funcall= and =apply=?
=funcall= calls a function with individual arguments. =apply= calls it with the
last argument being a list that is spread into the remaining arguments.

#+begin_src elisp
(funcall #'+ 1 2 3)        ; => 6
(apply #'+ 1 2 '(3 4))     ; => 10
#+end_src

** Q59: How do optional and rest arguments work?
#+begin_src elisp
(defun f (a &optional b &rest c)
  (list a b c))
(f 1)        ; => (1 nil nil)
(f 1 2 3 4)  ; => (1 2 (3 4))
#+end_src

** Q60: What is dynamic scope vs lexical scope?
Dynamic scope: a variable's binding is visible to all code called during the
binding's extent. Lexical scope: a variable is visible only within the textual
region where it's defined. Modern Elisp files should enable lexical binding.

