public/posts/elisp.html
<div id="outline-container-org6715731" class="outline-3">
<h3 id="org6715731">Q40: How do I read text from the buffer?</h3>
<div class="outline-text-3" id="text-org6715731">
<div class="org-src-container">
<pre class="src src-elisp">(buffer-string)                       <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">whole buffer
</span>(buffer-substring start end)          <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">with properties
</span>(buffer-substring-no-properties s e)  <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">plain text
</span>(thing-at-point 'word)
</pre>
</div>
</div>
</div>
<div id="outline-container-org9f61aaa" class="outline-3">
<h3 id="org9f61aaa">Q41: What is <code>save-excursion</code>?</h3>
<div class="outline-text-3" id="text-org9f61aaa">
<p>
A macro that saves point (and the current buffer) and restores them after its
body runs — even on non-local exit. Use it when you move point temporarily.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">save-excursion</span>
  (goto-char (point-min))
  (insert <span style="font-style: italic;">"header\n"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-org899dc1f" class="outline-3">
<h3 id="org899dc1f">Q42: What is <code>save-restriction</code>?</h3>
<div class="outline-text-3" id="text-org899dc1f">
<p>
Saves and restores the buffer's narrowing state (the visible region set by <code>narrow-to-region</code> / <code>widen</code>).
</p>
</div>
</div>
<div id="outline-container-orgb93a460" class="outline-3">
<h3 id="orgb93a460">Q43: How do I switch the buffer Elisp operates on?</h3>
<div class="outline-text-3" id="text-orgb93a460">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">with-current-buffer</span> <span style="font-style: italic;">"*scratch*"</span>
  (insert <span style="font-style: italic;">"hi"</span>))
(set-buffer buf)   <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">lower-level, no automatic restore</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgea33442" class="outline-3">
<h3 id="orgea33442">Q44: How do I create a new buffer?</h3>
<div class="outline-text-3" id="text-orgea33442">
<div class="org-src-container">
<pre class="src src-elisp">(get-buffer-create <span style="font-style: italic;">"*my-buffer*"</span>)
(generate-new-buffer <span style="font-style: italic;">"*my-buffer*"</span>)  <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">guarantees a fresh, uniquely-named one</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga232249" class="outline-3">
<h3 id="orga232249">Q45: What is the difference between <code>switch-to-buffer</code> and <code>set-buffer</code>?</h3>
<div class="outline-text-3" id="text-orga232249">
<p>
<code>switch-to-buffer</code> makes a buffer visible in the selected window (interactive,
display-oriented). <code>set-buffer</code> only changes the current buffer for Elisp; it
does not change what is displayed and is not preserved after the command.
</p>
</div>
</div>
<div id="outline-container-org3f7ef4d" class="outline-3">
<h3 id="org3f7ef4d">Q46: How do I read a file into a string?</h3>
<div class="outline-text-3" id="text-org3f7ef4d">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">with-temp-buffer</span>
  (insert-file-contents <span style="font-style: italic;">"/path/to/file"</span>)
  (buffer-string))
</pre>
</div>
</div>
</div>
<div id="outline-container-org2d65b80" class="outline-3">
<h3 id="org2d65b80">Q47: How do I write a string to a file?</h3>
<div class="outline-text-3" id="text-org2d65b80">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">with-temp-file</span> <span style="font-style: italic;">"/path/to/file"</span>
  (insert <span style="font-style: italic;">"content"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-org83b17c9" class="outline-3">
<h3 id="org83b17c9">Q48: What is <code>with-temp-buffer</code>?</h3>
<div class="outline-text-3" id="text-org83b17c9">
<p>
Creates a temporary buffer, makes it current for the body, and kills it afterward.
Ideal for text processing that shouldn't touch user buffers.
</p>
</div>
</div>
<div id="outline-container-org735e3fe" class="outline-3">
<h3 id="org735e3fe">Q49: How do I bind a key globally?</h3>
<div class="outline-text-3" id="text-org735e3fe">
<div class="org-src-container">
<pre class="src src-elisp">(global-set-key (kbd <span style="font-style: italic;">"C-c g"</span>) #'my-greet)
(keymap-global-set <span style="font-style: italic;">"C-c g"</span> #'my-greet)  <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">modern API (Emacs 29+)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org088d627" class="outline-3">
<h3 id="org088d627">Q50: How do I bind a key in a specific mode?</h3>
<div class="outline-text-3" id="text-org088d627">
<div class="org-src-container">
<pre class="src src-elisp">(define-key emacs-lisp-mode-map (kbd <span style="font-style: italic;">"C-c r"</span>) #'my-run)
(keymap-set emacs-lisp-mode-map <span style="font-style: italic;">"C-c r"</span> #'my-run)  <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Emacs 29+</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd22787c" class="outline-3">
<h3 id="orgd22787c">Q51: What is <code>kbd</code> and why use it?</h3>
<div class="outline-text-3" id="text-orgd22787c">
<p>
<code>kbd</code> converts a human-readable key description (<code>"C-c C-x"</code>) into the internal
key sequence representation. It's portable and clearer than raw string/vector forms.
</p>
</div>
</div>
<div id="outline-container-org09159c8" class="outline-3">
<h3 id="org09159c8">Q52: How do I prompt the user for input?</h3>
<div class="outline-text-3" id="text-org09159c8">
<div class="org-src-container">
<pre class="src src-elisp">(read-string <span style="font-style: italic;">"Name: "</span>)
(read-number <span style="font-style: italic;">"Count: "</span>)
(completing-read <span style="font-style: italic;">"Choose: "</span> '(<span style="font-style: italic;">"a"</span> <span style="font-style: italic;">"b"</span> <span style="font-style: italic;">"c"</span>))
(yes-or-no-p <span style="font-style: italic;">"Continue? "</span>)
(y-or-n-p <span style="font-style: italic;">"Continue? "</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org82158e6" class="outline-3">
<h3 id="org82158e6">Q53: What is the <code>interactive</code> spec code "p" vs "P"?</h3>
<div class="outline-text-3" id="text-org82158e6">
<p>
<code>p</code> passes the numeric prefix argument as a number. <code>P</code> passes the <b>raw</b> prefix
argument (e.g. <code>nil</code>, <code>(4)</code>, a number). Many codes exist: <code>s</code> string, <code>n</code>
number, <code>r</code> region, <code>b</code> buffer name, etc.
</p>
</div>
</div>
<div id="outline-container-orgcff1127" class="outline-3">
<h3 id="orgcff1127">Q54: How do I get the region's text?</h3>
<div class="outline-text-3" id="text-orgcff1127">
<div class="org-src-container">
<pre class="src src-elisp">(buffer-substring-no-properties (region-beginning) (region-end))
</pre>
</div>

<p>
For commands, declare <code>(interactive "r")</code> to receive start and end.
</p>
</div>
</div>
<div id="outline-container-orgf5faa55" class="outline-3">
<h3 id="orgf5faa55">Q55: How do I run code only after Emacs starts up?</h3>
<div class="outline-text-3" id="text-orgf5faa55">
<p>
Use <code>after-init-hook</code> or <code>emacs-startup-hook</code>:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(add-hook 'emacs-startup-hook #'my-startup-fn)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgada3a07" class="outline-2">
<h2 id="orgada3a07">Intermediate — Functions, Scope, Data</h2>
<div class="outline-text-2" id="text-orgada3a07">
</div>
<div id="outline-container-org7926cc9" class="outline-3">
<h3 id="org7926cc9">Q56: What is a lambda?</h3>
<div class="outline-text-3" id="text-org7926cc9">
<p>
An anonymous function:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">lambda</span> (x) (* x x))
(funcall (<span style="font-weight: bold;">lambda</span> (x) (* x x)) 5)  <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; 25</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org01f547e" class="outline-3">
<h3 id="org01f547e">Q57: What is the <code>#'</code> reader macro?</h3>
<div class="outline-text-3" id="text-org01f547e">
<p>
<code>#'foo</code> is shorthand for <code>(function foo)</code>. It quotes a function, and for
lambdas it signals to the byte-compiler that the form is a function (enabling compilation of the lambda).
</p>
</div>
</div>
<div id="outline-container-org2aac248" class="outline-3">
<h3 id="org2aac248">Q58: What is the difference between <code>funcall</code> and <code>apply</code>?</h3>
<div class="outline-text-3" id="text-org2aac248">
<p>
<code>funcall</code> calls a function with individual arguments. <code>apply</code> calls it with the
last argument being a list that is spread into the remaining arguments.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(funcall #'+ 1 2 3)        <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; 6
</span>(apply #'+ 1 2 '(3 4))     <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; 10</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org89d8ac2" class="outline-3">
<h3 id="org89d8ac2">Q59: How do optional and rest arguments work?</h3>
<div class="outline-text-3" id="text-org89d8ac2">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">f</span> (a <span style="font-weight: bold; text-decoration: underline;">&amp;optional</span> b <span style="font-weight: bold; text-decoration: underline;">&amp;rest</span> c)
  (list a b c))
(f 1)        <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; (1 nil nil)
</span>(f 1 2 3 4)  <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; (1 2 (3 4))</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8c39a25" class="outline-3">
<h3 id="org8c39a25">Q60: What is dynamic scope vs lexical scope?</h3>
<div class="outline-text-3" id="text-org8c39a25">
<p>
Dynamic scope: a variable's binding is visible to all code called during the
binding's extent. Lexical scope: a variable is visible only within the textual
region where it's defined. Modern Elisp files should enable lexical binding.
</p>
</div>
</div>
