org/posts/elisp.org
** Q61: How do I enable lexical binding?
Put this as the first line of the file:

#+begin_src elisp
;;; -*- lexical-binding: t; -*-
#+end_src

It is the default in Emacs 30+ for new files but should be declared explicitly.

** Q62: Why does lexical binding matter for closures?
Only with lexical binding do lambdas capture their surrounding variables to form true closures.

#+begin_src elisp
(defun make-adder (n)
  (lambda (x) (+ x n)))   ; n captured lexically
(funcall (make-adder 3) 10)  ; => 13
#+end_src

** Q63: What still uses dynamic scope?
Variables declared with =defvar=/=defconst= (special variables) remain dynamically scoped even under lexical binding.
This is intentional — it's how =let=-rebinding of configuration variables works.

** Q64: What is a property list (plist)?
A flat list of alternating keys and values:

#+begin_src elisp
(setq pl '(:name "Bob" :age 42))
(plist-get pl :name)             ; => "Bob"
(plist-put pl :age 43)
#+end_src

** Q65: What is an association list (alist)?
A list of cons cells (key . value):

#+begin_src elisp
(setq al '((a . 1) (b . 2)))
(assq 'a al)        ; => (a . 1)
(alist-get 'b al)   ; => 2
(cdr (assoc "k" al))
#+end_src

** Q66: When should I use a hash table instead of an alist?
For large collections or frequent lookups — hash tables give O(1) access vs alists' O(n).

#+begin_src elisp
(let ((h (make-hash-table :test 'equal)))
  (puthash "k" 1 h)
  (gethash "k" h))     ; => 1
#+end_src

** Q67: What =:test= options exist for hash tables?
=eq=, =eql=, =equal= (built-in), and you can define custom ones with =define-hash-table-test=.
Use =equal= for string keys.

** Q68: How do I iterate a hash table?
#+begin_src elisp
(maphash (lambda (k v) (message "%s=%s" k v)) h)
#+end_src

Or =(hash-table-keys h)= / =(hash-table-values h)= from =subr-x=/=map=.

** Q69: What is =mapcar= vs =mapc= vs =mapcan=?
 - =mapcar= — applies fn to each element, returns a new list of results.
 - =mapc= — applies fn for side effects, returns the input list.
 - =mapcan= — like mapcar but destructively concatenates the (list) results.

** Q70: How do I filter a list?
#+begin_src elisp
(seq-filter #'cl-evenp '(1 2 3 4))   ; => (2 4)
(cl-remove-if-not #'cl-evenp '(1 2 3 4))
#+end_src

** Q71: How do I reduce/fold a list?
#+begin_src elisp
(seq-reduce #'+ '(1 2 3 4) 0)        ; => 10
(cl-reduce #'+ '(1 2 3 4))           ; => 10
#+end_src

** Q72: What is the =seq= library?
A generic sequence-manipulation library (=seq.el=) that works uniformly across
lists, vectors, and strings: =seq-map=, =seq-filter=, =seq-find=, =seq-reduce=,
=seq-do=, =seq-uniq=, etc.

** Q73: What is =dash.el=?
A popular third-party functional library providing =-map=, =-filter=,
=-reduce=, threading macros =->= / =-->=, etc. Many prefer built-in =seq= now,
but dash remains common in the wild.

** Q74: How do I sort a list?
#+begin_src elisp
(sort '(3 1 2) #'<)            ; => (1 2 3)
(sort my-list :key #'car :lessp #'<) ; Emacs 30+ keyword form
#+end_src

Note: =sort= may be destructive; copy first if you need the original.

** Q75: How do I reverse a list?
#+begin_src elisp
(reverse '(1 2 3))    ; => (3 2 1) non-destructive
(nreverse my-list)    ; destructive, faster
#+end_src

** Q76: What is the difference between destructive and non-destructive functions?
Destructive functions (=nreverse=, =nconc=, =setcar=, =delete=) modify their arguments' structure in place;
non-destructive ones (=reverse=, =append=, =remove=) return fresh copies.
Destructive variants are faster but risk aliasing bugs.

** Q77: How do I copy a list or sequence?

#+begin_src elisp
(copy-sequence lst)     ; shallow copy
(copy-tree lst)         ; deep copy of the cons structure
#+end_src

** Q78: What is =cl-lib=?
The Common Lisp compatibility library shipped with Emacs.
It provides =cl-loop=, =cl-defun=, =cl-destructuring-bind=, =cl-case=,
generic sequence functions, structures (=cl-defstruct=), and more.
Always =(require 'cl-lib)=.

** Q79: How do I do a =case= / switch?
#+begin_src elisp
(cl-case x
  (1 "one")
  ((2 3) "two or three")
  (t "other"))
#+end_src

=pcase= is the more powerful, idiomatic modern choice.

