public/posts/elisp.html
<div id="outline-container-orga347ffa" class="outline-3">
<h3 id="orga347ffa">Q61: How do I enable lexical binding?</h3>
<div class="outline-text-3" id="text-orga347ffa">
<p>
Put this as the first line of the file:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;;; </span><span style="font-weight: bold; font-style: italic;">-*- lexical-binding: t; -*-</span>
</pre>
</div>

<p>
It is the default in Emacs 30+ for new files but should be declared explicitly.
</p>
</div>
</div>
<div id="outline-container-orga88dcbe" class="outline-3">
<h3 id="orga88dcbe">Q62: Why does lexical binding matter for closures?</h3>
<div class="outline-text-3" id="text-orga88dcbe">
<p>
Only with lexical binding do lambdas capture their surrounding variables to form true closures.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">make-adder</span> (n)
  (<span style="font-weight: bold;">lambda</span> (x) (+ x n)))   <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">n captured lexically
</span>(funcall (make-adder 3) 10)  <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; 13</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org53650ef" class="outline-3">
<h3 id="org53650ef">Q63: What still uses dynamic scope?</h3>
<div class="outline-text-3" id="text-org53650ef">
<p>
Variables declared with <code>defvar=/=defconst</code> (special variables) remain dynamically scoped even under lexical binding.
This is intentional — it's how <code>let</code>-rebinding of configuration variables works.
</p>
</div>
</div>
<div id="outline-container-org4058294" class="outline-3">
<h3 id="org4058294">Q64: What is a property list (plist)?</h3>
<div class="outline-text-3" id="text-org4058294">
<p>
A flat list of alternating keys and values:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">setq</span> pl '(<span style="font-weight: bold;">:name</span> <span style="font-style: italic;">"Bob"</span> <span style="font-weight: bold;">:age</span> 42))
(plist-get pl <span style="font-weight: bold;">:name</span>)             <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; "Bob"
</span>(plist-put pl <span style="font-weight: bold;">:age</span> 43)
</pre>
</div>
</div>
</div>
<div id="outline-container-org860066e" class="outline-3">
<h3 id="org860066e">Q65: What is an association list (alist)?</h3>
<div class="outline-text-3" id="text-org860066e">
<p>
A list of cons cells (key . value):
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">setq</span> al '((a . 1) (b . 2)))
(assq 'a al)        <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; (a . 1)
</span>(alist-get 'b al)   <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; 2
</span>(cdr (assoc <span style="font-style: italic;">"k"</span> al))
</pre>
</div>
</div>
</div>
<div id="outline-container-orga42b881" class="outline-3">
<h3 id="orga42b881">Q66: When should I use a hash table instead of an alist?</h3>
<div class="outline-text-3" id="text-orga42b881">
<p>
For large collections or frequent lookups — hash tables give O(1) access vs alists' O(n).
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">let</span> ((h (make-hash-table <span style="font-weight: bold;">:test</span> 'equal)))
  (puthash <span style="font-style: italic;">"k"</span> 1 h)
  (gethash <span style="font-style: italic;">"k"</span> h))     <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; 1</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org96b5443" class="outline-3">
<h3 id="org96b5443">Q67: What <code>:test</code> options exist for hash tables?</h3>
<div class="outline-text-3" id="text-org96b5443">
<p>
<code>eq</code>, <code>eql</code>, <code>equal</code> (built-in), and you can define custom ones with <code>define-hash-table-test</code>.
Use <code>equal</code> for string keys.
</p>
</div>
</div>
<div id="outline-container-org488d651" class="outline-3">
<h3 id="org488d651">Q68: How do I iterate a hash table?</h3>
<div class="outline-text-3" id="text-org488d651">
<div class="org-src-container">
<pre class="src src-elisp">(maphash (<span style="font-weight: bold;">lambda</span> (k v) (message <span style="font-style: italic;">"%s=%s"</span> k v)) h)
</pre>
</div>

<p>
Or <code>(hash-table-keys h)</code> / <code>(hash-table-values h)</code> from <code>subr-x=/=map</code>.
</p>
</div>
</div>
<div id="outline-container-orged007ce" class="outline-3">
<h3 id="orged007ce">Q69: What is <code>mapcar</code> vs <code>mapc</code> vs <code>mapcan</code>?</h3>
<div class="outline-text-3" id="text-orged007ce">
<ul class="org-ul">
<li><code>mapcar</code> — applies fn to each element, returns a new list of results.</li>
<li><code>mapc</code> — applies fn for side effects, returns the input list.</li>
<li><code>mapcan</code> — like mapcar but destructively concatenates the (list) results.</li>
</ul>
</div>
</div>
<div id="outline-container-org5987ed7" class="outline-3">
<h3 id="org5987ed7">Q70: How do I filter a list?</h3>
<div class="outline-text-3" id="text-org5987ed7">
<div class="org-src-container">
<pre class="src src-elisp">(seq-filter #'cl-evenp '(1 2 3 4))   <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; (2 4)
</span>(cl-remove-if-not #'cl-evenp '(1 2 3 4))
</pre>
</div>
</div>
</div>
<div id="outline-container-org23d22da" class="outline-3">
<h3 id="org23d22da">Q71: How do I reduce/fold a list?</h3>
<div class="outline-text-3" id="text-org23d22da">
<div class="org-src-container">
<pre class="src src-elisp">(seq-reduce #'+ '(1 2 3 4) 0)        <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; 10
</span>(cl-reduce #'+ '(1 2 3 4))           <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; 10</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge9595fe" class="outline-3">
<h3 id="orge9595fe">Q72: What is the <code>seq</code> library?</h3>
<div class="outline-text-3" id="text-orge9595fe">
<p>
A generic sequence-manipulation library (<code>seq.el</code>) that works uniformly across
lists, vectors, and strings: <code>seq-map</code>, <code>seq-filter</code>, <code>seq-find</code>, <code>seq-reduce</code>,
<code>seq-do</code>, <code>seq-uniq</code>, etc.
</p>
</div>
</div>
<div id="outline-container-org23e0d89" class="outline-3">
<h3 id="org23e0d89">Q73: What is <code>dash.el</code>?</h3>
<div class="outline-text-3" id="text-org23e0d89">
<p>
A popular third-party functional library providing <code>-map</code>, <code>-filter</code>,
<code>-reduce</code>, threading macros <code>-&gt;</code> / <code>--&gt;</code>, etc. Many prefer built-in <code>seq</code> now,
but dash remains common in the wild.
</p>
</div>
</div>
<div id="outline-container-orgbbe5245" class="outline-3">
<h3 id="orgbbe5245">Q74: How do I sort a list?</h3>
<div class="outline-text-3" id="text-orgbbe5245">
<div class="org-src-container">
<pre class="src src-elisp">(sort '(3 1 2) #'&lt;)            <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; (1 2 3)
</span>(sort my-list <span style="font-weight: bold;">:key</span> #'car <span style="font-weight: bold;">:lessp</span> #'&lt;) <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Emacs 30+ keyword form</span>
</pre>
</div>

<p>
Note: <code>sort</code> may be destructive; copy first if you need the original.
</p>
</div>
</div>
<div id="outline-container-org6c15faf" class="outline-3">
<h3 id="org6c15faf">Q75: How do I reverse a list?</h3>
<div class="outline-text-3" id="text-org6c15faf">
<div class="org-src-container">
<pre class="src src-elisp">(reverse '(1 2 3))    <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; (3 2 1) non-destructive
</span>(nreverse my-list)    <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">destructive, faster</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga9913f9" class="outline-3">
<h3 id="orga9913f9">Q76: What is the difference between destructive and non-destructive functions?</h3>
<div class="outline-text-3" id="text-orga9913f9">
<p>
Destructive functions (<code>nreverse</code>, <code>nconc</code>, <code>setcar</code>, <code>delete</code>) modify their arguments' structure in place;
non-destructive ones (<code>reverse</code>, <code>append</code>, <code>remove</code>) return fresh copies.
Destructive variants are faster but risk aliasing bugs.
</p>
</div>
</div>
<div id="outline-container-orgf5bada1" class="outline-3">
<h3 id="orgf5bada1">Q77: How do I copy a list or sequence?</h3>
<div class="outline-text-3" id="text-orgf5bada1">
<div class="org-src-container">
<pre class="src src-elisp">(copy-sequence lst)     <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">shallow copy
</span>(copy-tree lst)         <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">deep copy of the cons structure</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7c857dd" class="outline-3">
<h3 id="org7c857dd">Q78: What is <code>cl-lib</code>?</h3>
<div class="outline-text-3" id="text-org7c857dd">
<p>
The Common Lisp compatibility library shipped with Emacs.
It provides <code>cl-loop</code>, <code>cl-defun</code>, <code>cl-destructuring-bind</code>, <code>cl-case</code>,
generic sequence functions, structures (<code>cl-defstruct</code>), and more.
Always <code>(require 'cl-lib)</code>.
</p>
</div>
</div>
<div id="outline-container-orgc0a586f" class="outline-3">
<h3 id="orgc0a586f">Q79: How do I do a <code>case</code> / switch?</h3>
<div class="outline-text-3" id="text-orgc0a586f">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">cl-case</span> x
  (1 <span style="font-style: italic;">"one"</span>)
  ((2 3) <span style="font-style: italic;">"two or three"</span>)
  (t <span style="font-style: italic;">"other"</span>))
</pre>
</div>

<p>
<code>pcase</code> is the more powerful, idiomatic modern choice.
</p>
</div>
</div>
