org/posts/elisp.org
** Q80: What is =pcase=?
A pattern-matching =case=. It destructures and matches by structure, type, predicate, etc.

#+begin_src elisp

(pcase value

  ((pred stringp) "a string")

  (`(,a . ,b) (format "cons %s %s" a b))

  ((or 1 2 3) "small number")

  (_ "anything else"))

#+end_src

** Q81: How do I destructure a list?
#+begin_src elisp
(cl-destructuring-bind (a b &optional c) '(1 2)
  (list a b c))            ; => (1 2 nil)
(pcase-let ((`(,x ,y) '(1 2))) (+ x y))  ; => 3
(seq-let (a b) '(1 2 3) (list a b))      ; => (1 2)
#+end_src

* Intermediate — Macros, Errors, Control Flow
** Q82: What is a macro?
A function that runs at *expansion time*, receiving unevaluated code and returning new code to be evaluated.
Macros let you extend the language syntax and control evaluation.

** Q83: How do I define a macro?

#+begin_src elisp
(defmacro my-unless (cond &rest body)
  `(if ,cond nil (progn ,@body)))
#+end_src

** Q84: What is the backquote (=`=), comma (=,=), and =,@=?
 - Backquote starts a template where most things are literal.
 - =,= unquotes — evaluates and inserts the value.
 - =,@= splices a list's elements into the surrounding list.

** Q85: How do I see what a macro expands to?

#+begin_src elisp
(macroexpand '(my-unless t (foo)))
(macroexpand-1 ...)     ; one level
(macroexpand-all ...)   ; fully
#+end_src

=M-x emacs-lisp-macroexpand= or =pp-macroexpand-last-sexp= for interactive use.

** Q86: What is variable capture / hygiene in macros?
When a macro introduces a binding whose name collides with user code, causing bugs.
Avoid it by generating unique symbols with =gensym=/=cl-gensym= or =make-symbol=.

#+begin_src elisp
(defmacro my-swap (a b)
  (let ((tmp (gensym)))
    `(let ((,tmp ,a)) (setf ,a ,b) (setf ,b ,tmp))))
#+end_src

** Q87: When should I use a macro vs a function?
Use a function by default. Use a macro only when you must control evaluation
(delay/repeat/skip arguments), introduce binding forms, or generate code at
compile time. Macros don't compose like functions (can't =funcall= them).

** Q88: How do I signal an error?
#+begin_src elisp
(error "Bad value: %s" x)
(user-error "Please select a region")  ; for user mistakes, no debugger
(signal 'wrong-type-argument (list 'stringp x))
#+end_src

** Q89: How do I catch errors?
#+begin_src elisp
(condition-case err
    (risky-operation)
  (file-missing (message "No file: %s" err))
  (error (message "Failed: %s" (error-message-string err))))
#+end_src

** Q90: What is =unwind-protect=?
Guarantees cleanup forms run whether or not the protected body exits normally or via error/non-local exit — like =try/finally=.

#+begin_src elisp
(unwind-protect
    (do-something)
  (cleanup))
#+end_src

** Q91: What is =ignore-errors= and =with-demoted-errors=?
=ignore-errors= evaluates body and returns nil on any error.
=with-demoted-errors= turns errors into messages (useful in hooks/init so one failure doesn't abort everything).

** Q92: What are =catch= and =throw=?
A non-local exit mechanism by tag:

#+begin_src elisp
(catch 'found
  (dolist (x list)
    (when (match-p x) (throw 'found x))))
#+end_src

** Q93: What is =cl-block= / =cl-return=?
A lexical exit construct from =cl-lib=. =cl-return-from= exits a named block;
=cl-defun= establishes an implicit block named after the function.

** Q94: How do I define a custom error type?
#+begin_src elisp
(define-error 'my-error "My custom error" 'error)
;; then: (signal 'my-error (list "details"))
#+end_src

** Q95: What is =cl-loop=?
A very powerful iteration macro from cl-lib:
#+begin_src elisp
(cl-loop for i from 1 to 5
         when (cl-oddp i)
         collect (* i i))     ; => (1 9 25)
#+end_src

* Intermediate/Advanced — Buffers, Text, Regexp
** Q96: How do I search forward for a regexp?
#+begin_src elisp
(when (re-search-forward "foo\\(bar\\)?" nil t)
  (match-string 0))
#+end_src

The third arg =t= means "return nil instead of erroring on failure."

** Q97: Why are backslashes doubled in Elisp regexps?
Because the regexp is written as a string, and string syntax also uses
backslash escapes. So a regexp group =\(...\)= must be written =\\(...\\)= in the string literal. =rx= avoids this.

