public/posts/elisp.html
<div id="outline-container-org94ba93e" class="outline-3">
<h3 id="org94ba93e">Q80: What is <code>pcase</code>?</h3>
<div class="outline-text-3" id="text-org94ba93e">
<p>
A pattern-matching <code>case</code>. It destructures and matches by structure, type, predicate, etc.
</p>

<div class="org-src-container">
<pre class="src src-elisp">
(<span style="font-weight: bold;">pcase</span> value

  ((pred stringp) <span style="font-style: italic;">"a string"</span>)

  (`(,a . ,b) (format <span style="font-style: italic;">"cons %s %s"</span> a b))

  ((<span style="font-weight: bold;">or</span> 1 2 3) <span style="font-style: italic;">"small number"</span>)

  (_ <span style="font-style: italic;">"anything else"</span>))

</pre>
</div>
</div>
</div>
<div id="outline-container-org9e2a408" class="outline-3">
<h3 id="org9e2a408">Q81: How do I destructure a list?</h3>
<div class="outline-text-3" id="text-org9e2a408">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">cl-destructuring-bind</span> (a b <span style="font-weight: bold; text-decoration: underline;">&amp;optional</span> c) '(1 2)
  (list a b c))            <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; (1 2 nil)
</span>(<span style="font-weight: bold;">pcase-let</span> ((`(,x ,y) '(1 2))) (+ x y))  <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; 3
</span>(<span style="font-weight: bold;">seq-let</span> (a b) '(1 2 3) (list a b))      <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; (1 2)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbb74f2f" class="outline-2">
<h2 id="orgbb74f2f">Intermediate — Macros, Errors, Control Flow</h2>
<div class="outline-text-2" id="text-orgbb74f2f">
</div>
<div id="outline-container-orgb40f0ef" class="outline-3">
<h3 id="orgb40f0ef">Q82: What is a macro?</h3>
<div class="outline-text-3" id="text-orgb40f0ef">
<p>
A function that runs at <b>expansion time</b>, receiving unevaluated code and returning new code to be evaluated.
Macros let you extend the language syntax and control evaluation.
</p>
</div>
</div>
<div id="outline-container-org77ec2cd" class="outline-3">
<h3 id="org77ec2cd">Q83: How do I define a macro?</h3>
<div class="outline-text-3" id="text-org77ec2cd">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">defmacro</span> <span style="font-weight: bold;">my-unless</span> (cond <span style="font-weight: bold; text-decoration: underline;">&amp;rest</span> body)
  `(<span style="font-weight: bold;">if</span> ,cond nil (<span style="font-weight: bold;">progn</span> ,@body)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org31c4a33" class="outline-3">
<h3 id="org31c4a33">Q84: What is the backquote (<code>`</code>), comma (<code>,</code>), and <code>,@</code>?</h3>
<div class="outline-text-3" id="text-org31c4a33">
<ul class="org-ul">
<li>Backquote starts a template where most things are literal.</li>
<li><code>,</code> unquotes — evaluates and inserts the value.</li>
<li><code>,@</code> splices a list's elements into the surrounding list.</li>
</ul>
</div>
</div>
<div id="outline-container-org0e36ca5" class="outline-3">
<h3 id="org0e36ca5">Q85: How do I see what a macro expands to?</h3>
<div class="outline-text-3" id="text-org0e36ca5">
<div class="org-src-container">
<pre class="src src-elisp">(macroexpand '(my-unless t (foo)))
(macroexpand-1 ...)     <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">one level
</span>(macroexpand-all ...)   <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">fully</span>
</pre>
</div>

<p>
<code>M-x emacs-lisp-macroexpand</code> or <code>pp-macroexpand-last-sexp</code> for interactive use.
</p>
</div>
</div>
<div id="outline-container-orgcec568d" class="outline-3">
<h3 id="orgcec568d">Q86: What is variable capture / hygiene in macros?</h3>
<div class="outline-text-3" id="text-orgcec568d">
<p>
When a macro introduces a binding whose name collides with user code, causing bugs.
Avoid it by generating unique symbols with <code>gensym=/=cl-gensym</code> or <code>make-symbol</code>.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">defmacro</span> <span style="font-weight: bold;">my-swap</span> (a b)
  (<span style="font-weight: bold;">let</span> ((tmp (gensym)))
    `(<span style="font-weight: bold;">let</span> ((,tmp ,a)) (<span style="font-weight: bold;">setf</span> ,a ,b) (<span style="font-weight: bold;">setf</span> ,b ,tmp))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge4afede" class="outline-3">
<h3 id="orge4afede">Q87: When should I use a macro vs a function?</h3>
<div class="outline-text-3" id="text-orge4afede">
<p>
Use a function by default. Use a macro only when you must control evaluation
(delay/repeat/skip arguments), introduce binding forms, or generate code at
compile time. Macros don't compose like functions (can't <code>funcall</code> them).
</p>
</div>
</div>
<div id="outline-container-org7780d98" class="outline-3">
<h3 id="org7780d98">Q88: How do I signal an error?</h3>
<div class="outline-text-3" id="text-org7780d98">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">error</span> <span style="font-style: italic;">"Bad value: %s"</span> x)
(<span style="font-weight: bold;">user-error</span> <span style="font-style: italic;">"Please select a region"</span>)  <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">for user mistakes, no debugger
</span>(<span style="font-weight: bold;">signal</span> 'wrong-type-argument (list 'stringp x))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb41bd77" class="outline-3">
<h3 id="orgb41bd77">Q89: How do I catch errors?</h3>
<div class="outline-text-3" id="text-orgb41bd77">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">condition-case</span> err
    (risky-operation)
  (file-missing (message <span style="font-style: italic;">"No file: %s"</span> err))
  (<span style="font-weight: bold;">error</span> (message <span style="font-style: italic;">"Failed: %s"</span> (error-message-string err))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org12ac291" class="outline-3">
<h3 id="org12ac291">Q90: What is <code>unwind-protect</code>?</h3>
<div class="outline-text-3" id="text-org12ac291">
<p>
Guarantees cleanup forms run whether or not the protected body exits normally or via error/non-local exit — like <code>try/finally</code>.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">unwind-protect</span>
    (do-something)
  (cleanup))
</pre>
</div>
</div>
</div>
<div id="outline-container-org66421ac" class="outline-3">
<h3 id="org66421ac">Q91: What is <code>ignore-errors</code> and <code>with-demoted-errors</code>?</h3>
<div class="outline-text-3" id="text-org66421ac">
<p>
<code>ignore-errors</code> evaluates body and returns nil on any error.
<code>with-demoted-errors</code> turns errors into messages (useful in hooks/init so one failure doesn't abort everything).
</p>
</div>
</div>
<div id="outline-container-org40ccc89" class="outline-3">
<h3 id="org40ccc89">Q92: What are <code>catch</code> and <code>throw</code>?</h3>
<div class="outline-text-3" id="text-org40ccc89">
<p>
A non-local exit mechanism by tag:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">catch</span> '<span style="font-weight: bold; text-decoration: underline;">found</span>
  (<span style="font-weight: bold;">dolist</span> (x list)
    (<span style="font-weight: bold;">when</span> (match-p x) (<span style="font-weight: bold;">throw</span> '<span style="font-weight: bold; text-decoration: underline;">found</span> x))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbfd2446" class="outline-3">
<h3 id="orgbfd2446">Q93: What is <code>cl-block</code> / <code>cl-return</code>?</h3>
<div class="outline-text-3" id="text-orgbfd2446">
<p>
A lexical exit construct from <code>cl-lib</code>. <code>cl-return-from</code> exits a named block;
<code>cl-defun</code> establishes an implicit block named after the function.
</p>
</div>
</div>
<div id="outline-container-orgcec4b2a" class="outline-3">
<h3 id="orgcec4b2a">Q94: How do I define a custom error type?</h3>
<div class="outline-text-3" id="text-orgcec4b2a">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">define-error</span> '<span style="font-weight: bold; font-style: italic;">my-error</span> <span style="font-style: italic;">"My custom error"</span> 'error)
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">then: (signal 'my-error (list "details"))</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf576852" class="outline-3">
<h3 id="orgf576852">Q95: What is <code>cl-loop</code>?</h3>
<div class="outline-text-3" id="text-orgf576852">
<p>
A very powerful iteration macro from cl-lib:
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">cl-loop</span> for i from 1 to 5
         when (cl-oddp i)
         collect (* i i))     <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; (1 9 25)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9b28a8e" class="outline-2">
<h2 id="org9b28a8e">Intermediate/Advanced — Buffers, Text, Regexp</h2>
<div class="outline-text-2" id="text-org9b28a8e">
</div>
<div id="outline-container-org648cb7f" class="outline-3">
<h3 id="org648cb7f">Q96: How do I search forward for a regexp?</h3>
<div class="outline-text-3" id="text-org648cb7f">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">when</span> (re-search-forward <span style="font-style: italic;">"foo</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">(</span><span style="font-style: italic;">bar</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">)</span><span style="font-style: italic;">?"</span> nil t)
  (match-string 0))
</pre>
</div>

<p>
The third arg <code>t</code> means "return nil instead of erroring on failure."
</p>
</div>
</div>
<div id="outline-container-org8d0b659" class="outline-3">
<h3 id="org8d0b659">Q97: Why are backslashes doubled in Elisp regexps?</h3>
<div class="outline-text-3" id="text-org8d0b659">
<p>
Because the regexp is written as a string, and string syntax also uses
backslash escapes. So a regexp group <code>\(...\)</code> must be written <code>\\(...\\)</code> in the string literal. <code>rx</code> avoids this.
</p>
</div>
</div>
