org/posts/elisp.org
** Q98: What is =rx=?
A macro that builds regexps from readable s-expressions, eliminating backslash soup:

#+begin_src elisp
(rx bol (group (+ digit)) "-" (group (+ alpha)) eol)
#+end_src

** Q99: How do I get the matched text after a search?
#+begin_src elisp
(match-string 0)               ; whole match (from buffer)
(match-string 1)               ; first group
(match-string-no-properties 1)
(match-beginning 1) (match-end 1)
#+end_src

** Q100: How do I replace text matching a regexp programmatically?
#+begin_src elisp
(while (re-search-forward "foo" nil t)
  (replace-match "bar"))
;; or on strings:
(replace-regexp-in-string "foo" "bar" "foofoo")
#+end_src

** Q101: What is the difference between =looking-at= and =re-search-forward=?
=looking-at= tests whether text *starting at point* matches a regexp without
moving point. =re-search-forward= scans forward and moves point past the match.

** Q102: How do I narrow the buffer?
#+begin_src elisp
(narrow-to-region start end)   ; restrict visible/operable text
(widen)                        ; restore
#+end_src
Wrap in =save-restriction= when narrowing temporarily.

** Q103: What are markers?
Objects that point to a position in a buffer and *move automatically* as text
is inserted/deleted, unlike plain integer positions. Use them when you need a
position to stay valid across edits.

** Q104: What are text properties?
Attributes attached to characters in a buffer/string (e.g. =face=, =read-only=, custom keys). They travel with the text.

#+begin_src elisp
(put-text-property start end 'face 'bold)
(propertize "hi" 'face 'warning)
(get-text-property pos 'face)
#+end_src


** Q105: What is the difference between text properties and overlays?
Text properties are part of the buffer text (copied/saved with it). Overlays
are separate objects layered over a region, independent of the text, ideal for
transient highlighting (e.g. search, flycheck). Overlays can be slower in large
numbers.

** Q106: How do I create an overlay?
#+begin_src elisp
(let ((ov (make-overlay start end)))
  (overlay-put ov 'face 'highlight))
#+end_src
 
** Q107: How do I delete a region of text?
#+begin_src elisp
(delete-region start end)
(delete-char 1)        ; at point
(kill-region s e)      ; deletes and saves to kill ring
#+end_src

** Q108: How do I process a buffer line by line?
#+begin_src elisp
(goto-char (point-min))
(while (not (eobp))
  (let ((line (buffer-substring-no-properties
               (line-beginning-position) (line-end-position))))
    ;; process line
    (forward-line 1)))
#+end_src
 
** Q109: What do =bobp= and =eobp= mean?
=bobp= → point is at beginning of buffer; =eobp= → point is at end of buffer.
Also =bolp= / =eolp= for line beginning/end.

** Q110: How do I make a buffer read-only temporarily during code?
#+begin_src elisp
(let ((inhibit-read-only t))
  (insert "text"))      ; bypass read-only for the body
#+end_src

* Advanced — Modes, Hooks, Customization

** Q111: What is a major mode?
A mode that defines the primary behavior of a buffer (syntax, keymap,
font-locking, indentation). Each buffer has exactly one major mode. Defined
with =define-derived-mode=.

** Q112: What is a minor mode?
A toggleable feature that augments behavior independently of the major mode
(e.g. =flyspell-mode=). Many minor modes can be active at once. Defined with
=define-minor-mode=.

** Q113: How do I define a minor mode?
#+begin_src elisp
(define-minor-mode my-mode
  "Toggle My mode."
  :init-value nil
  :lighter " My"
  :keymap (make-sparse-keymap)
  (if my-mode
      (message "enabled")
    (message "disabled")))
#+end_src

** Q114: How do I define a derived major mode?
#+begin_src elisp
(define-derived-mode my-mode prog-mode "MyLang"
  "Major mode for MyLang."
  (setq-local comment-start "# ")
  (setq-local font-lock-defaults '(my-keywords)))
#+end_src

** Q115: What is a hook?
A variable holding a list of functions run at a defined point (e.g.
=prog-mode-hook=, =before-save-hook=). Add functions with =add-hook=.

** Q116: How do I add a function to a hook?
#+begin_src elisp
(add-hook 'prog-mode-hook #'display-line-numbers-mode)
(add-hook 'prog-mode-hook #'my-fn 90)   ; depth/append control
(remove-hook 'prog-mode-hook #'my-fn)
#+end_src

** Q117: Why use =#'= when adding to a hook?
It makes the intent (a function reference) explicit and lets the byte-compiler
warn if the function is undefined. Plain symbols work too, but lambdas in hooks
are hard to remove and should generally be avoided.

