public/posts/elisp.html
<div id="outline-container-org795355d" class="outline-3">
<h3 id="org795355d">Q98: What is <code>rx</code>?</h3>
<div class="outline-text-3" id="text-org795355d">
<p>
A macro that builds regexps from readable s-expressions, eliminating backslash soup:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">rx</span> bol (group (+ digit)) <span style="font-style: italic;">"-"</span> (group (+ alpha)) eol)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf862a37" class="outline-3">
<h3 id="orgf862a37">Q99: How do I get the matched text after a search?</h3>
<div class="outline-text-3" id="text-orgf862a37">
<div class="org-src-container">
<pre class="src src-elisp">(match-string 0)               <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">whole match (from buffer)
</span>(match-string 1)               <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">first group
</span>(match-string-no-properties 1)
(match-beginning 1) (match-end 1)
</pre>
</div>
</div>
</div>
<div id="outline-container-orge80e232" class="outline-3">
<h3 id="orge80e232">Q100: How do I replace text matching a regexp programmatically?</h3>
<div class="outline-text-3" id="text-orge80e232">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">while</span> (re-search-forward <span style="font-style: italic;">"foo"</span> nil t)
  (replace-match <span style="font-style: italic;">"bar"</span>))
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">or on strings:
</span>(replace-regexp-in-string <span style="font-style: italic;">"foo"</span> <span style="font-style: italic;">"bar"</span> <span style="font-style: italic;">"foofoo"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf8d0d4a" class="outline-3">
<h3 id="orgf8d0d4a">Q101: What is the difference between <code>looking-at</code> and <code>re-search-forward</code>?</h3>
<div class="outline-text-3" id="text-orgf8d0d4a">
<p>
<code>looking-at</code> tests whether text <b>starting at point</b> matches a regexp without
moving point. <code>re-search-forward</code> scans forward and moves point past the match.
</p>
</div>
</div>
<div id="outline-container-org47874e9" class="outline-3">
<h3 id="org47874e9">Q102: How do I narrow the buffer?</h3>
<div class="outline-text-3" id="text-org47874e9">
<div class="org-src-container">
<pre class="src src-elisp">(narrow-to-region start end)   <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">restrict visible/operable text
</span>(widen)                        <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">restore</span>
</pre>
</div>
<p>
Wrap in <code>save-restriction</code> when narrowing temporarily.
</p>
</div>
</div>
<div id="outline-container-org92ebf4d" class="outline-3">
<h3 id="org92ebf4d">Q103: What are markers?</h3>
<div class="outline-text-3" id="text-org92ebf4d">
<p>
Objects that point to a position in a buffer and <b>move automatically</b> as text
is inserted/deleted, unlike plain integer positions. Use them when you need a
position to stay valid across edits.
</p>
</div>
</div>
<div id="outline-container-orge3a78fc" class="outline-3">
<h3 id="orge3a78fc">Q104: What are text properties?</h3>
<div class="outline-text-3" id="text-orge3a78fc">
<p>
Attributes attached to characters in a buffer/string (e.g. <code>face</code>, <code>read-only</code>, custom keys). They travel with the text.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(put-text-property start end 'face 'bold)
(propertize <span style="font-style: italic;">"hi"</span> 'face 'warning)
(get-text-property pos 'face)
</pre>
</div>
</div>
</div>
<div id="outline-container-org3f30d2d" class="outline-3">
<h3 id="org3f30d2d">Q105: What is the difference between text properties and overlays?</h3>
<div class="outline-text-3" id="text-org3f30d2d">
<p>
Text properties are part of the buffer text (copied/saved with it). Overlays
are separate objects layered over a region, independent of the text, ideal for
transient highlighting (e.g. search, flycheck). Overlays can be slower in large
numbers.
</p>
</div>
</div>
<div id="outline-container-org6ac61da" class="outline-3">
<h3 id="org6ac61da">Q106: How do I create an overlay?</h3>
<div class="outline-text-3" id="text-org6ac61da">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">let</span> ((ov (make-overlay start end)))
  (overlay-put ov 'face 'highlight))
</pre>
</div>
</div>
</div>
<div id="outline-container-org8021243" class="outline-3">
<h3 id="org8021243">Q107: How do I delete a region of text?</h3>
<div class="outline-text-3" id="text-org8021243">
<div class="org-src-container">
<pre class="src src-elisp">(delete-region start end)
(delete-char 1)        <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">at point
</span>(kill-region s e)      <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">deletes and saves to kill ring</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf6e37eb" class="outline-3">
<h3 id="orgf6e37eb">Q108: How do I process a buffer line by line?</h3>
<div class="outline-text-3" id="text-orgf6e37eb">
<div class="org-src-container">
<pre class="src src-elisp">(goto-char (point-min))
(<span style="font-weight: bold;">while</span> (not (eobp))
  (<span style="font-weight: bold;">let</span> ((line (buffer-substring-no-properties
               (line-beginning-position) (line-end-position))))
    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">process line
</span>    (forward-line 1)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb44aa6d" class="outline-3">
<h3 id="orgb44aa6d">Q109: What do <code>bobp</code> and <code>eobp</code> mean?</h3>
<div class="outline-text-3" id="text-orgb44aa6d">
<p>
<code>bobp</code> → point is at beginning of buffer; <code>eobp</code> → point is at end of buffer.
Also <code>bolp</code> / <code>eolp</code> for line beginning/end.
</p>
</div>
</div>
<div id="outline-container-org67d61d2" class="outline-3">
<h3 id="org67d61d2">Q110: How do I make a buffer read-only temporarily during code?</h3>
<div class="outline-text-3" id="text-org67d61d2">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">let</span> ((inhibit-read-only t))
  (insert <span style="font-style: italic;">"text"</span>))      <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">bypass read-only for the body</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb411e96" class="outline-2">
<h2 id="orgb411e96">Advanced — Modes, Hooks, Customization</h2>
<div class="outline-text-2" id="text-orgb411e96">
</div>
<div id="outline-container-org9c2a31f" class="outline-3">
<h3 id="org9c2a31f">Q111: What is a major mode?</h3>
<div class="outline-text-3" id="text-org9c2a31f">
<p>
A mode that defines the primary behavior of a buffer (syntax, keymap,
font-locking, indentation). Each buffer has exactly one major mode. Defined
with <code>define-derived-mode</code>.
</p>
</div>
</div>
<div id="outline-container-org776a1b2" class="outline-3">
<h3 id="org776a1b2">Q112: What is a minor mode?</h3>
<div class="outline-text-3" id="text-org776a1b2">
<p>
A toggleable feature that augments behavior independently of the major mode
(e.g. <code>flyspell-mode</code>). Many minor modes can be active at once. Defined with
<code>define-minor-mode</code>.
</p>
</div>
</div>
<div id="outline-container-orgec892ad" class="outline-3">
<h3 id="orgec892ad">Q113: How do I define a minor mode?</h3>
<div class="outline-text-3" id="text-orgec892ad">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">define-minor-mode</span> <span style="font-weight: bold;">my-mode</span>
  <span style="font-style: italic;">"Toggle My mode."</span>
  <span style="font-weight: bold;">:init-value</span> nil
  <span style="font-weight: bold;">:lighter</span> <span style="font-style: italic;">" My"</span>
  <span style="font-weight: bold;">:keymap</span> (make-sparse-keymap)
  (<span style="font-weight: bold;">if</span> my-mode
      (message <span style="font-style: italic;">"enabled"</span>)
    (message <span style="font-style: italic;">"disabled"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org2cdcdae" class="outline-3">
<h3 id="org2cdcdae">Q114: How do I define a derived major mode?</h3>
<div class="outline-text-3" id="text-org2cdcdae">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">define-derived-mode</span> <span style="font-weight: bold;">my-mode</span> prog-mode <span style="font-style: italic;">"MyLang"</span>
  <span style="font-style: italic;">"Major mode for MyLang."</span>
  (<span style="font-weight: bold;">setq-local</span> comment-start <span style="font-style: italic;">"# "</span>)
  (<span style="font-weight: bold;">setq-local</span> font-lock-defaults '(my-keywords)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org06a2e2e" class="outline-3">
<h3 id="org06a2e2e">Q115: What is a hook?</h3>
<div class="outline-text-3" id="text-org06a2e2e">
<p>
A variable holding a list of functions run at a defined point (e.g.
<code>prog-mode-hook</code>, <code>before-save-hook</code>). Add functions with <code>add-hook</code>.
</p>
</div>
</div>
<div id="outline-container-org67fd899" class="outline-3">
<h3 id="org67fd899">Q116: How do I add a function to a hook?</h3>
<div class="outline-text-3" id="text-org67fd899">
<div class="org-src-container">
<pre class="src src-elisp">(add-hook 'prog-mode-hook #'display-line-numbers-mode)
(add-hook 'prog-mode-hook #'my-fn 90)   <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">depth/append control
</span>(remove-hook 'prog-mode-hook #'my-fn)
</pre>
</div>
</div>
</div>
<div id="outline-container-org612133e" class="outline-3">
<h3 id="org612133e">Q117: Why use <code>#'</code> when adding to a hook?</h3>
<div class="outline-text-3" id="text-org612133e">
<p>
It makes the intent (a function reference) explicit and lets the byte-compiler
warn if the function is undefined. Plain symbols work too, but lambdas in hooks
are hard to remove and should generally be avoided.
</p>
</div>
</div>
