org/posts/elisp.org
** Q118: What is =setq-local= vs =setq-default=?
=setq-local= sets a buffer-local value. =setq-default= sets the default value
that buffers without a local binding see. =make-local-variable= /
=make-variable-buffer-local= control buffer-locality.

** Q119: What is a buffer-local variable?
A variable whose value can differ per buffer. Mode code commonly uses
=setq-local= to configure per-buffer behavior without affecting other buffers.

** Q120: What is =defcustom=?
Declares a user-customizable variable integrated with the Customize UI,
including a type, group, and docstring.

#+begin_src elisp
(defcustom my-width 80
  "Preferred width."
  :type 'integer
  :group 'my-group)
#+end_src

** Q121: What is =defgroup= and =defface=?
=defgroup= declares a customization group to organize options. =defface=
declares a customizable face (font/color set) used for text display.

** Q122: How do I make a variable safe as a file-local variable?
Set its =safe-local-variable= property with a predicate, or use the
=:safe= keyword in =defcustom=:
#+begin_src elisp
(defcustom my-opt 1 "..." :type 'integer :safe #'integerp)
#+end_src

** Q123: What is =add-to-list= and how does it differ from =push=?
=add-to-list= adds an element only if not already present (using =equal= by
default) and evaluates its arguments; it's meant for list-valued variables.
=push= always prepends and is a generalized-variable macro. For =defcustom=
lists, prefer setting via Customize or =add-to-list=.

** Q124: What is =use-package=?
A macro (built into Emacs 29+) for declarative, organized package configuration
— deferring loading, binding keys, setting variables, and adding hooks in one tidy form.

#+begin_src elisp
(use-package magit
  :bind ("C-x g" . magit-status)
  :config (setq magit-diff-refine-hunk t))
#+end_src

** Q125: How does autoloading work?
An autoload registers a function name so that calling it loads the defining
file on demand. Created via the =;;;###autoload= magic comment and generated
autoload files, or =autoload= directly. It speeds startup by deferring loads.

* Advanced — Performance, Compilation, Async
** Q126: What is byte-compilation?
Compiling =.el= to =.elc= bytecode for faster loading/execution and earlier
warnings. =byte-compile-file=, =M-x byte-recompile-directory=. Warnings catch
undefined functions, unused vars, etc.

** Q127: What is native compilation?
Emacs 28+ can compile Elisp to native machine code via libgccjit
(=native-comp=), giving significant speedups. =.eln= files are produced and
cached. Triggered automatically (=native-comp-jit-compilation=) or via
=native-compile=.

** Q128: How do I benchmark Elisp code?
#+begin_src elisp
(benchmark-run 1000 (my-function))   ; => (total-time gc-count gc-time)
(benchmark-elapse (my-function))
#+end_src

** Q129: How do I profile Elisp?
Use the built-in profiler:
#+begin_src elisp
(profiler-start 'cpu)
;; ... do work ...
(profiler-report)
(profiler-stop)
#+end_src

** Q130: Why can lists be slow, and what's the alternative?
=nth=/=length= on long lists are O(n). For random access use vectors; for
keyed lookup use hash tables. Building a list with repeated =append= is O(n^2);
prefer =push= + =nreverse=.

** Q131: What is the purpose of =nreverse= after =push= in loops?
=push= prepends (O(1)), building the list in reverse. =nreverse= flips it to
the intended order at the end — an idiomatic, efficient way to accumulate a
list.

** Q132: How do I avoid garbage and speed up tight loops?
Use lexical binding, prefer built-in primitives, avoid consing in loops,
preallocate vectors, use =cl-loop= with =collect=, and byte/native compile.
Raise =gc-cons-threshold= temporarily for bulk work.

** Q133: Is Elisp single-threaded?
Effectively yes for Lisp execution. Emacs 26+ has cooperative threads
(=make-thread=) but they don't run truly in parallel — they yield at blocking
points. Long computations still block the UI.

 

** Q134: How do I run things asynchronously without blocking Emacs?
 - =run-with-timer= / =run-with-idle-timer= for deferred work.
 - Process-based async via =make-process= / =start-process= with filters and
   sentinels.
 - =url-retrieve= for async HTTP; libraries like =async.el= for subprocess Lisp.

** Q135: What is a process filter and sentinel?
A *filter* function receives output chunks from an asynchronous process. A
*sentinel* is called when the process changes state (e.g. exits). Together they
let you handle subprocess I/O without blocking.

#+begin_src elisp
(make-process :name "ls" :command '("ls")
              :filter (lambda (proc out) (message "%s" out))
              :sentinel (lambda (proc ev) (message "done: %s" ev)))
#+end_src

** Q136: How do I run a shell command and get its output?
#+begin_src elisp
(shell-command-to-string "echo hi")
(call-process "ls" nil t nil "-l")   ; synchronous, into current buffer
#+end_src

** Q137: What is a timer?
A scheduled callback. =run-with-timer= fires after a delay (optionally
repeating); =run-with-idle-timer= fires when Emacs has been idle for a period.
Cancel with =cancel-timer=.

