public/posts/elisp.html
<div id="outline-container-org3bcb607" class="outline-3">
<h3 id="org3bcb607">Q118: What is <code>setq-local</code> vs <code>setq-default</code>?</h3>
<div class="outline-text-3" id="text-org3bcb607">
<p>
<code>setq-local</code> sets a buffer-local value. <code>setq-default</code> sets the default value
that buffers without a local binding see. <code>make-local-variable</code> /
<code>make-variable-buffer-local</code> control buffer-locality.
</p>
</div>
</div>
<div id="outline-container-org4227d69" class="outline-3">
<h3 id="org4227d69">Q119: What is a buffer-local variable?</h3>
<div class="outline-text-3" id="text-org4227d69">
<p>
A variable whose value can differ per buffer. Mode code commonly uses
<code>setq-local</code> to configure per-buffer behavior without affecting other buffers.
</p>
</div>
</div>
<div id="outline-container-orgbb780fd" class="outline-3">
<h3 id="orgbb780fd">Q120: What is <code>defcustom</code>?</h3>
<div class="outline-text-3" id="text-orgbb780fd">
<p>
Declares a user-customizable variable integrated with the Customize UI,
including a type, group, and docstring.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">defcustom</span> <span style="font-weight: bold; font-style: italic;">my-width</span> 80
  <span style="font-style: italic;">"Preferred width."</span>
  <span style="font-weight: bold;">:type</span> 'integer
  <span style="font-weight: bold;">:group</span> 'my-group)
</pre>
</div>
</div>
</div>
<div id="outline-container-orga5dd06e" class="outline-3">
<h3 id="orga5dd06e">Q121: What is <code>defgroup</code> and <code>defface</code>?</h3>
<div class="outline-text-3" id="text-orga5dd06e">
<p>
<code>defgroup</code> declares a customization group to organize options. <code>defface</code>
declares a customizable face (font/color set) used for text display.
</p>
</div>
</div>
<div id="outline-container-org3806120" class="outline-3">
<h3 id="org3806120">Q122: How do I make a variable safe as a file-local variable?</h3>
<div class="outline-text-3" id="text-org3806120">
<p>
Set its <code>safe-local-variable</code> property with a predicate, or use the
<code>:safe</code> keyword in <code>defcustom</code>:
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">defcustom</span> <span style="font-weight: bold; font-style: italic;">my-opt</span> 1 <span style="font-style: italic;">"..."</span> <span style="font-weight: bold;">:type</span> 'integer <span style="font-weight: bold;">:safe</span> #'integerp)
</pre>
</div>
</div>
</div>
<div id="outline-container-org6e78783" class="outline-3">
<h3 id="org6e78783">Q123: What is <code>add-to-list</code> and how does it differ from <code>push</code>?</h3>
<div class="outline-text-3" id="text-org6e78783">
<p>
<code>add-to-list</code> adds an element only if not already present (using <code>equal</code> by
default) and evaluates its arguments; it's meant for list-valued variables.
<code>push</code> always prepends and is a generalized-variable macro. For <code>defcustom</code>
lists, prefer setting via Customize or <code>add-to-list</code>.
</p>
</div>
</div>
<div id="outline-container-org64fb19c" class="outline-3">
<h3 id="org64fb19c">Q124: What is <code>use-package</code>?</h3>
<div class="outline-text-3" id="text-org64fb19c">
<p>
A macro (built into Emacs 29+) for declarative, organized package configuration
— deferring loading, binding keys, setting variables, and adding hooks in one tidy form.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">use-package</span> magit
  <span style="font-weight: bold;">:bind</span> (<span style="font-style: italic;">"C-x g"</span> . magit-status)
  <span style="font-weight: bold;">:config</span> (<span style="font-weight: bold;">setq</span> magit-diff-refine-hunk t))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb38bab6" class="outline-3">
<h3 id="orgb38bab6">Q125: How does autoloading work?</h3>
<div class="outline-text-3" id="text-orgb38bab6">
<p>
An autoload registers a function name so that calling it loads the defining
file on demand. Created via the <code>;;;###autoload</code> magic comment and generated
autoload files, or <code>autoload</code> directly. It speeds startup by deferring loads.
</p>
</div>
</div>
</div>
<div id="outline-container-org3b3afd8" class="outline-2">
<h2 id="org3b3afd8">Advanced — Performance, Compilation, Async</h2>
<div class="outline-text-2" id="text-org3b3afd8">
</div>
<div id="outline-container-orgb7abb9b" class="outline-3">
<h3 id="orgb7abb9b">Q126: What is byte-compilation?</h3>
<div class="outline-text-3" id="text-orgb7abb9b">
<p>
Compiling <code>.el</code> to <code>.elc</code> bytecode for faster loading/execution and earlier
warnings. <code>byte-compile-file</code>, <code>M-x byte-recompile-directory</code>. Warnings catch
undefined functions, unused vars, etc.
</p>
</div>
</div>
<div id="outline-container-org3760e3d" class="outline-3">
<h3 id="org3760e3d">Q127: What is native compilation?</h3>
<div class="outline-text-3" id="text-org3760e3d">
<p>
Emacs 28+ can compile Elisp to native machine code via libgccjit
(<code>native-comp</code>), giving significant speedups. <code>.eln</code> files are produced and
cached. Triggered automatically (<code>native-comp-jit-compilation</code>) or via
<code>native-compile</code>.
</p>
</div>
</div>
<div id="outline-container-org511b9b7" class="outline-3">
<h3 id="org511b9b7">Q128: How do I benchmark Elisp code?</h3>
<div class="outline-text-3" id="text-org511b9b7">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">benchmark-run</span> 1000 (my-function))   <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; (total-time gc-count gc-time)
</span>(benchmark-elapse (my-function))
</pre>
</div>
</div>
</div>
<div id="outline-container-org3890d70" class="outline-3">
<h3 id="org3890d70">Q129: How do I profile Elisp?</h3>
<div class="outline-text-3" id="text-org3890d70">
<p>
Use the built-in profiler:
</p>
<div class="org-src-container">
<pre class="src src-elisp">(profiler-start 'cpu)
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">... do work ...
</span>(profiler-report)
(profiler-stop)
</pre>
</div>
</div>
</div>
<div id="outline-container-org46a7220" class="outline-3">
<h3 id="org46a7220">Q130: Why can lists be slow, and what's the alternative?</h3>
<div class="outline-text-3" id="text-org46a7220">
<p>
<code>nth=/=length</code> on long lists are O(n). For random access use vectors; for
keyed lookup use hash tables. Building a list with repeated <code>append</code> is O(n<sup>2</sup>);
prefer <code>push</code> + <code>nreverse</code>.
</p>
</div>
</div>
<div id="outline-container-org3b5bf5b" class="outline-3">
<h3 id="org3b5bf5b">Q131: What is the purpose of <code>nreverse</code> after <code>push</code> in loops?</h3>
<div class="outline-text-3" id="text-org3b5bf5b">
<p>
<code>push</code> prepends (O(1)), building the list in reverse. <code>nreverse</code> flips it to
the intended order at the end — an idiomatic, efficient way to accumulate a
list.
</p>
</div>
</div>
<div id="outline-container-org9628304" class="outline-3">
<h3 id="org9628304">Q132: How do I avoid garbage and speed up tight loops?</h3>
<div class="outline-text-3" id="text-org9628304">
<p>
Use lexical binding, prefer built-in primitives, avoid consing in loops,
preallocate vectors, use <code>cl-loop</code> with <code>collect</code>, and byte/native compile.
Raise <code>gc-cons-threshold</code> temporarily for bulk work.
</p>
</div>
</div>
<div id="outline-container-org3e51e5c" class="outline-3">
<h3 id="org3e51e5c">Q133: Is Elisp single-threaded?</h3>
<div class="outline-text-3" id="text-org3e51e5c">
<p>
Effectively yes for Lisp execution. Emacs 26+ has cooperative threads
(<code>make-thread</code>) but they don't run truly in parallel — they yield at blocking
points. Long computations still block the UI.
</p>
</div>
</div>
<div id="outline-container-org585e752" class="outline-3">
<h3 id="org585e752">Q134: How do I run things asynchronously without blocking Emacs?</h3>
<div class="outline-text-3" id="text-org585e752">
<ul class="org-ul">
<li><code>run-with-timer</code> / <code>run-with-idle-timer</code> for deferred work.</li>
<li>Process-based async via <code>make-process</code> / <code>start-process</code> with filters and
sentinels.</li>
<li><code>url-retrieve</code> for async HTTP; libraries like <code>async.el</code> for subprocess Lisp.</li>
</ul>
</div>
</div>
<div id="outline-container-orgae78fdc" class="outline-3">
<h3 id="orgae78fdc">Q135: What is a process filter and sentinel?</h3>
<div class="outline-text-3" id="text-orgae78fdc">
<p>
A <b>filter</b> function receives output chunks from an asynchronous process. A
<b>sentinel</b> is called when the process changes state (e.g. exits). Together they
let you handle subprocess I/O without blocking.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(make-process <span style="font-weight: bold;">:name</span> <span style="font-style: italic;">"ls"</span> <span style="font-weight: bold;">:command</span> '(<span style="font-style: italic;">"ls"</span>)
              <span style="font-weight: bold;">:filter</span> (<span style="font-weight: bold;">lambda</span> (proc out) (message <span style="font-style: italic;">"%s"</span> out))
              <span style="font-weight: bold;">:sentinel</span> (<span style="font-weight: bold;">lambda</span> (proc ev) (message <span style="font-style: italic;">"done: %s"</span> ev)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org7796f0a" class="outline-3">
<h3 id="org7796f0a">Q136: How do I run a shell command and get its output?</h3>
<div class="outline-text-3" id="text-org7796f0a">
<div class="org-src-container">
<pre class="src src-elisp">(shell-command-to-string <span style="font-style: italic;">"echo hi"</span>)
(call-process <span style="font-style: italic;">"ls"</span> nil t nil <span style="font-style: italic;">"-l"</span>)   <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">synchronous, into current buffer</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org027b49b" class="outline-3">
<h3 id="org027b49b">Q137: What is a timer?</h3>
<div class="outline-text-3" id="text-org027b49b">
<p>
A scheduled callback. <code>run-with-timer</code> fires after a delay (optionally
repeating); <code>run-with-idle-timer</code> fires when Emacs has been idle for a period.
Cancel with <code>cancel-timer</code>.
</p>
</div>
</div>
