org/posts/elisp.org
** Q138: What is debouncing and how do I implement it in Elisp?
Delaying an action until input settles. Implement by canceling a pending timer
and rescheduling on each event:

#+begin_src elisp
(defvar my--timer nil)
(defun my-debounced ()
  (when my--timer (cancel-timer my--timer))
  (setq my--timer (run-with-idle-timer 0.5 nil #'my-do-work)))
#+end_src

-----

#+INCLUDE: "../footer.org"
