public/posts/elisp.html
<div id="outline-container-org0c8e0dd" class="outline-3">
<h3 id="org0c8e0dd">Q138: What is debouncing and how do I implement it in Elisp?</h3>
<div class="outline-text-3" id="text-org0c8e0dd">
<p>
Delaying an action until input settles. Implement by canceling a pending timer
and rescheduling on each event:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">defvar</span> <span style="font-weight: bold; font-style: italic;">my--timer</span> nil)
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my-debounced</span> ()
  (<span style="font-weight: bold;">when</span> my--timer (cancel-timer my--timer))
  (<span style="font-weight: bold;">setq</span> my--timer (run-with-idle-timer 0.5 nil #'my-do-work)))
</pre>
</div>

<hr>

<div class="site-footer">
    <ul class="social-icons">
        <li><a href="https://github.com/bdostumski" rel="nofollow noopener noreferrer"><i class="fab fa-fw fa-github" aria-hidden="true"></i> GitHub</a></li>
        <li><a href="https://www.linkedin.com/in/borislav-dostumski/" rel="nofollow noopener noreferrer"><i class="fab fa-linux" aria-hidden="true"></i> LinkedIn</a></li>
        <li><a href="https://www.youtube.com/@borislavdostumski6006" rel="nofollow noopener noreferrer"><i class="fab fa-linux" aria-hidden="true"></i> YouTube</a></li>
    </ul>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
